abelykh0/stm32h7uvc/Main/usbd_video.c
/**
  ******************************************************************************
  * @file    usbd_video.c
  * @author  MCD Application Team
  * @brief   This file provides the Video core functions.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  * @verbatim
  *
  *          ===================================================================
  *                                VIDEO Class  Description
  *          ===================================================================
  *           This driver manages the Video Class 1.1 following the "USB Device Class Definition for
  *           Video Devices V1.0 Mar 18, 98".
  *           This driver implements the following aspects of the specification:
  *             - Device descriptor management
  *             - Configuration descriptor management
  *             - Interface Association Descriptor
  *             -Standard VC Interface Descriptor  = interface 0
  *             -Standard Vs Interface Descriptor  = interface 1
  *             - 1 Video Streaming Interface
  *             - 1 Video Streaming Endpoint
  *             - 1 Video Terminal Input (camera)
  *             - Video Class-Specific AC Interfaces
  *             - Video Class-Specific AS Interfaces
  *             - VideoControl Requests
  *             - Video Synchronization type: Asynchronous
  *          The current  Video class version supports the following Video features:
  *             - image JPEG format
  *             - Asynchronous Endpoints
  *
  * @note     In HS mode and when the USB DMA is used, all variables and data structures
  *           dealing with the DMA during the transaction process should be 32-bit aligned.
  *
  *
  *  @endverbatim
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "usbd_video.h"
#include "usbd_ctlreq.h"
#include "usbd_core.h"
#include "stm32h7xx_hal.h"
#include "jpeg.h"
#include <stdbool.h>
#include "screen/canvas.h"

static uint8_t chunkIndex;
static uint8_t* mdmaOutput;
static uint8_t outbytes0[153600];
static uint8_t outbytes1[153600];
static uint8_t* write_pointer = outbytes0;
static uint8_t* read_pointer = outbytes0;
static uint32_t jpgLength = 0;
static bool jpeg_encode_done = true;

/* VIDEO Device library callbacks */
static uint8_t USBD_VIDEO_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t USBD_VIDEO_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t USBD_VIDEO_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);

#ifndef USE_USBD_COMPOSITE
static uint8_t *USBD_VIDEO_GetFSCfgDesc(uint16_t *length);
static uint8_t *USBD_VIDEO_GetHSCfgDesc(uint16_t *length);
static uint8_t *USBD_VIDEO_GetOtherSpeedCfgDesc(uint16_t *length);
static uint8_t *USBD_VIDEO_GetDeviceQualifierDesc(uint16_t *length);
#endif /* USE_USBD_COMPOSITE */

static uint8_t USBD_VIDEO_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_VIDEO_SOF(USBD_HandleTypeDef *pdev);
static uint8_t USBD_VIDEO_IsoINIncomplete(USBD_HandleTypeDef *pdev, uint8_t epnum);

/* VIDEO Requests management functions */
static void VIDEO_REQ_GetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static void VIDEO_REQ_SetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);

#ifndef USE_USBD_COMPOSITE
static void *USBD_VIDEO_GetVSFrameDesc(uint8_t *pConfDesc);
#endif /* USE_USBD_COMPOSITE */

static void *USBD_VIDEO_GetVideoHeaderDesc(uint8_t *pConfDesc);

/**
  * @}
  */

/** @defgroup USBD_VIDEO_Private_Variables
  * @{
  */

USBD_ClassTypeDef  USBD_VIDEO =
{
  USBD_VIDEO_Init,
  USBD_VIDEO_DeInit,
  USBD_VIDEO_Setup,
  NULL,
  NULL,
  USBD_VIDEO_DataIn,
  NULL,
  USBD_VIDEO_SOF,
  USBD_VIDEO_IsoINIncomplete,
  NULL,
#ifdef USE_USBD_COMPOSITE
  NULL,
  NULL,
  NULL,
  NULL,
#else
  USBD_VIDEO_GetHSCfgDesc,
  USBD_VIDEO_GetFSCfgDesc,
  USBD_VIDEO_GetOtherSpeedCfgDesc,
  USBD_VIDEO_GetDeviceQualifierDesc,
#endif /* USE_USBD_COMPOSITE */
};

/* USB VIDEO device Configuration Descriptor (same for all speeds thanks to user defines) */
__ALIGN_BEGIN static uint8_t USBD_VIDEO_CfgDesc[] __ALIGN_END =
{
  /* Configuration 1 */
  USB_CONF_DESC_SIZE,                            /* bLength: Configuration Descriptor size */
  USB_DESC_TYPE_CONFIGURATION,                   /* bDescriptorType: Configuration */
  LOBYTE(UVC_CONFIG_DESC_SIZ),                   /* wTotalLength: no of returned bytes */
  HIBYTE(UVC_CONFIG_DESC_SIZ),
  0x02,                                          /* bNumInterfaces: 2 interfaces */
  0x01,                                          /* bConfigurationValue: Configuration value */
  0x00,                                          /* iConfiguration: Index of string descriptor
                                                  describing the configuration */
#if (USBD_SELF_POWERED == 1U)
  0xC0,                                          /* bmAttributes: Bus Powered according to user configuration */
#else
  0x80,                                          /* bmAttributes: Bus Powered according to user configuration */
#endif /* USBD_SELF_POWERED */
  USBD_MAX_POWER,                                /* bMaxPower in mA according to user configuration */

  /* Interface Association Descriptor */
  USB_IAD_DESC_SIZE,                             /* bLength: Interface Association Descriptor size */
  USB_DESC_TYPE_IAD,                             /* bDescriptorType: interface association */
  0x00,                                          /* bFirstInterface */
  0x02,                                          /* bInterfaceCount */
  UVC_CC_VIDEO,                                  /* bFunctionClass: Video class */
  SC_VIDEO_INTERFACE_COLLECTION,                 /* bFunctionSubClass: Video Interface Collection */
  PC_PROTOCOL_UNDEFINED,                         /* bInterfaceProtocol: protocol undefined */
  0x00,                                          /* iFunction */

  /* Standard VC (Video Control) Interface Descriptor  = interface 0 */
  USB_IF_DESC_SIZE,                              /* bLength: interface descriptor size */
  USB_DESC_TYPE_INTERFACE,                       /* bDescriptorType: interface */
  UVC_VC_IF_NUM,                                 /* bInterfaceNumber: interface number */
  0x00,                                          /* bAlternateSetting: index of this alternate setting */
  0x00,                                          /* bNumEndpoints: No endpoints used for this interface */
  UVC_CC_VIDEO,                                  /* bInterfaceClass: Video Class */
  SC_VIDEOCONTROL,                               /* bInterfaceSubClass: Video Control */
  PC_PROTOCOL_UNDEFINED,                         /* bInterfaceProtocol: protocol is undefined */
  0x00,                                          /* iFunction: index of string descriptor relative to this item */

  /* Class-specific VC Interface Descriptor */
  VIDEO_VC_IF_HEADER_DESC_SIZE,                  /* bLength */
  CS_INTERFACE,                                  /* bDescriptorType */
  VC_HEADER,                                     /* bDescriptorSubtype */
  LOBYTE(UVC_VERSION),
  HIBYTE(UVC_VERSION),                           /* bcdUVC: UVC1.0 or UVC1.1 revision */
  VS_FRAME_DESC_SIZE,                            /* wTotalLength: total size of class-specific descriptors */
  0x00,
  0x00,                                          /* dwClockFrequency: not used. 48 Mhz value is set, but not used */
  0x6C,
  0xDC,
  0x02,
  0x01,                                          /* bInCollection: number of streaming interfaces */
  0x01,                                          /* baInterfaceNr(1): VideoStreaming interface 1 is part
                                                    of VC interface */
  /* Input Terminal Descriptor */
  VIDEO_IN_TERMINAL_DESC_SIZE,                   /* bLength: Input terminal descriptor size */
  CS_INTERFACE,                                  /* bDescriptorType: INTERFACE */
  VC_INPUT_TERMINAL,                             /* bDescriptorSubtype: INPUT_TERMINAL */
  0x01,                                          /* bTerminalID: ID of this Terminal */
  LOBYTE(ITT_VENDOR_SPECIFIC),                   /* wTerminalType: 0x0200 ITT_VENDOR_SPECIFIC */
  HIBYTE(ITT_VENDOR_SPECIFIC),
  0x00,                                          /* bAssocTerminal: no Terminal is associated */
  0x00,                                          /* iTerminal: index of string descriptor relative to this item */

  /* Output Terminal Descriptor */
  VIDEO_OUT_TERMINAL_DESC_SIZE,                  /* bLength: output terminal descriptor size */
  CS_INTERFACE,                                  /* bDescriptorType */
  VC_OUTPUT_TERMINAL,                            /* bDescriptorSubtype */
  0x02,                                          /* bTerminalID */
  LOBYTE(TT_STREAMING),                          /* wTerminalType: USB streaming terminal */
  HIBYTE(TT_STREAMING),
  0x00,                                          /* bAssocTerminal: no Terminal is associated */
  0x01,                                          /* bSourceID: input is connected to output unit ID 1 */
  0x00,                                          /* iTerminal: index of string descriptor relative to this item */

  /* Standard VS (Video Streaming) Interface Descriptor = interface 1, alternate setting 0 = Zero Bandwidth
    (when no data are sent from the device) */
  USB_IF_DESC_SIZE,                              /* bLength: interface descriptor size */
  USB_DESC_TYPE_INTERFACE,                       /* bDescriptorType */
  UVC_VS_IF_NUM,                                 /* bInterfaceNumber */
  0x00,                                          /* bAlternateSetting */
  0x00,                                          /* bNumEndpoints: no endpoints used for alternate setting 0 */
  UVC_CC_VIDEO,                                  /* bInterfaceClass */
  SC_VIDEOSTREAMING,                             /* bInterfaceSubClass */
  PC_PROTOCOL_UNDEFINED,                         /* bInterfaceProtocol */
  0x00,                                          /* iInterface: index of string descriptor relative to this item */

