abelykh0/stm32h7uvc/Main/usbd_video.c
void HAL_JPEG_GetDataCallback(JPEG_HandleTypeDef *hjpeg, uint32_t NbDecodedData)
{
	chunkIndex++;
	uint8_t* mdmaInput = GetChunkPointer(chunkIndex);
    HAL_JPEG_ConfigInputBuffer(hjpeg, mdmaInput, CHUNK_SIZE);
}

void HAL_JPEG_DataReadyCallback(JPEG_HandleTypeDef *hjpeg, uint8_t *pDataOut, uint32_t OutDataLength)
{
	jpgLength = OutDataLength;
}

void HAL_JPEG_EncodeCpltCallback(JPEG_HandleTypeDef *hjpeg)
{
	jpeg_encode_done = true;
}

/**
  * @brief  USBD_VIDEO_DataIn
  *         handle data IN Stage
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_VIDEO_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum) {
	USBD_VIDEO_HandleTypeDef* hVIDEO = (USBD_VIDEO_HandleTypeDef*)pdev->pClassData;

	static uint16_t packets_cnt = 0xffff;
	static uint8_t header[2] = { 2, 0 }; //length + data
	static uint32_t picture_pos;
	static uint16_t packets_in_frame = 1;
	static uint16_t last_packet_size = 0;
	static uint8_t tx_enable_flag = 0;

	USBD_LL_FlushEP(pdev, UVC_IN_EP); //very important

	if (tx_enable_flag)
	{
		packets_cnt++;
	}

	if (tx_enable_flag == 0 && jpeg_encode_done)
	{
		jpeg_encode_done = false;
		switch_buffers();

		// start of new frame
		packets_cnt = 0;
		header[1] ^= 1; // toggle bit0 every new frame
		picture_pos = 0;

		packets_in_frame = (jpgLength / ((uint16_t)PACKET_SIZE_NO_HEADER)) + 1;
		last_packet_size = (jpgLength - ((packets_in_frame - 1) * ((uint16_t)PACKET_SIZE_NO_HEADER)) + 2);

		// start encoding using DMA, when done HAL_JPEG_DataReadyCallback is called
		/*
		SCB_InvalidateICache();
		*/

		chunkIndex = 0;
		uint8_t* mdmaInput = GetChunkPointer(chunkIndex);
		mdmaOutput = write_pointer + sizeof(header);
		HAL_JPEG_Encode_DMA(&hjpeg,
				mdmaInput, CHUNK_SIZE,
				mdmaOutput, sizeof(outbytes0) - sizeof(header));
		/*
		HAL_JPEG_Encode(&hjpeg, canvas, sizeof(canvas),
				write_pointer + sizeof(header),
				sizeof(outbytes0) - sizeof(header), HAL_MAX_DELAY);
		*/

		tx_enable_flag = 1;
	}

	if (hVIDEO->uvc_state == UVC_PLAY_STATUS_STREAMING)
	{
		read_pointer[picture_pos + 0] = header[0];
		read_pointer[picture_pos + 1] = header[1];

		if (packets_cnt < (packets_in_frame - 1))
		{
			USBD_LL_Transmit(pdev, (uint8_t) (epnum | UVC_REQ_READ_MASK),
					(uint8_t*)&read_pointer[picture_pos],
					(uint32_t)UVC_ISO_FS_MPS);
			picture_pos += PACKET_SIZE_NO_HEADER;
		}
		else if (tx_enable_flag == 1)
		{
			USBD_LL_Transmit(pdev, (uint8_t) (epnum | UVC_REQ_READ_MASK),
					(uint8_t*)&read_pointer[picture_pos],
					(uint32_t)last_packet_size);
			tx_enable_flag = 0;
			picture_pos = 0;
		}
		else
		{
			// Only while very first frame is still encoding
			USBD_LL_Transmit(pdev, (uint8_t)(epnum | UVC_REQ_READ_MASK),
					(uint8_t*)header, 2);
			picture_pos = 0; //protection from overflow
		}
	} else
	{
		packets_cnt = 0xffff;
	}

	return USBD_OK;
}

/**
  * @brief  USBD_VIDEO_SOF
  *         handle SOF event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t  USBD_VIDEO_SOF(USBD_HandleTypeDef *pdev)
{
  USBD_VIDEO_HandleTypeDef *hVIDEO = (USBD_VIDEO_HandleTypeDef *) pdev->pClassDataCmsit[pdev->classId];
  uint8_t payload[2] = {0x02U, 0x00U};

#ifdef USE_USBD_COMPOSITE
  /* Get the Endpoints addresses allocated for this class instance */
  VIDEOinEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_IN, USBD_EP_TYPE_ISOC, (uint8_t)pdev->classId);
#endif /* USE_USBD_COMPOSITE */

  /* Check if the Streaming has already been started by SetInterface AltSetting 1 */
  if (hVIDEO->uvc_state == UVC_PLAY_STATUS_READY)
  {
    hVIDEO->uvc_buffer = (uint8_t *)&payload;
    hVIDEO->uvc_size = 2U;

    /* Transmit the first packet indicating that Streaming is starting */
    (void)USBD_LL_Transmit(pdev, VIDEOinEpAdd, hVIDEO->uvc_buffer, hVIDEO->uvc_size);

    /* Enable Streaming state */
    hVIDEO->uvc_state = UVC_PLAY_STATUS_STREAMING;
  }

  /* Exit with no error code */
  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_VIDEO_IsoINIncomplete
  *         handle data ISO IN Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_VIDEO_IsoINIncomplete(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_VIDEO_HandleTypeDef *hVIDEO = (USBD_VIDEO_HandleTypeDef *) pdev->pClassDataCmsit[pdev->classId];

#ifdef USE_USBD_COMPOSITE
  /* Get the Endpoints addresses allocated for this class instance */
  VIDEOinEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_IN, USBD_EP_TYPE_ISOC, (uint8_t)pdev->classId);
#endif /* USE_USBD_COMPOSITE */

  if (epnum == (VIDEOinEpAdd & 0xFU))
  {
    (void)USBD_LL_Transmit(pdev, VIDEOinEpAdd, hVIDEO->uvc_buffer, hVIDEO->uvc_size);
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  VIDEO_Req_GetCurrent
  *         Handles the GET_CUR VIDEO control request.
  * @param  pdev: instance
  * @param  req: setup class request
  * @retval status
  */
static void VIDEO_REQ_GetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
  USBD_VIDEO_HandleTypeDef *hVIDEO;
  hVIDEO = (USBD_VIDEO_HandleTypeDef *)(pdev->pClassDataCmsit[pdev->classId]);
  static __IO uint8_t EntityStatus[8] = {0};

  /* Reset buffer to zeros */
  (void) USBD_memset(hVIDEO->control.data, 0, USB_MAX_EP0_SIZE);

  /* Manage Video Control interface requests */
  if (LOBYTE(req->wIndex) == 0x00U)
  {
    if (HIBYTE(req->wValue) == 0x02U)
    {
      /* Get the status of the current requested Entity */
      EntityStatus[0] = 0x06U;

      /* Send current status */
      (void) USBD_CtlSendData(pdev, (uint8_t *)&EntityStatus, 1U);
    }
    else
    {
      /* Unknown request */
      USBD_CtlError(pdev, req);
    }
  }
  /* Manage Video Streaming interface requests */
  else
  {
    if (LOBYTE(req->wValue) == (uint8_t)VS_PROBE_CONTROL)
    {
      /* Update bPreferedVersion, bMinVersion and bMaxVersion which must be set only by Device */
      video_Probe_Control.bPreferedVersion = 0x00U;
      video_Probe_Control.bMinVersion = 0x00U;
      video_Probe_Control.bMaxVersion = 0x00U;
      video_Probe_Control.dwMaxVideoFrameSize = UVC_MAX_FRAME_SIZE;

      video_Probe_Control.dwClockFrequency = 0x02DC6C00U;

      if (pdev->dev_speed == USBD_SPEED_HIGH)
      {
        video_Probe_Control.dwFrameInterval = (UVC_INTERVAL(UVC_CAM_FPS_HS));
        video_Probe_Control.dwMaxPayloadTransferSize = UVC_ISO_HS_MPS;
      }
      else
      {
        video_Probe_Control.dwFrameInterval = (UVC_INTERVAL(UVC_CAM_FPS_FS));
        video_Probe_Control.dwMaxPayloadTransferSize = UVC_ISO_FS_MPS;
      }

