abelykh0/stm32h7uvc/Main/usbd_video.c
      /* Probe Request */
      (void)USBD_CtlSendData(pdev, (uint8_t *)&video_Probe_Control,
                             MIN(req->wLength, sizeof(USBD_VideoControlTypeDef)));
    }
    else if (LOBYTE(req->wValue) == (uint8_t)VS_COMMIT_CONTROL)
    {
      if (pdev->dev_speed == USBD_SPEED_HIGH)
      {
        video_Commit_Control.dwFrameInterval = (UVC_INTERVAL(UVC_CAM_FPS_HS));
        video_Commit_Control.dwMaxPayloadTransferSize = UVC_ISO_HS_MPS;
      }
      else
      {
        video_Commit_Control.dwFrameInterval = (UVC_INTERVAL(UVC_CAM_FPS_FS));
        video_Commit_Control.dwMaxPayloadTransferSize = UVC_ISO_FS_MPS;
      }

      /* Commit Request */
      (void)USBD_CtlSendData(pdev, (uint8_t *)&video_Commit_Control,
                             MIN(req->wLength, sizeof(USBD_VideoControlTypeDef)));
    }
    else
    {
      /* Send the current state */
      (void) USBD_CtlSendData(pdev, hVIDEO->control.data,
                              MIN(req->wLength, USB_MAX_EP0_SIZE));
    }
  }
}

/**
  * @brief  VIDEO_Req_SetCurrent
  *         Handles the SET_CUR VIDEO control request.
  * @param  pdev: instance
  * @param  req: setup class request
  * @retval status
  */
static void VIDEO_REQ_SetCurrent(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{

  /* Check that the request has control data */
  if (req->wLength > 0U)
  {
    /* Prepare the reception of the buffer over EP0 */
    if (req->wValue == (uint16_t)VS_PROBE_CONTROL)
    {
      /* Probe Request */
      (void) USBD_CtlPrepareRx(pdev, (uint8_t *)&video_Probe_Control,
                               MIN(req->wLength, sizeof(USBD_VideoControlTypeDef)));
    }
    else if (req->wValue == (uint16_t)VS_COMMIT_CONTROL)
    {
      /* Commit Request */
      (void) USBD_CtlPrepareRx(pdev, (uint8_t *)&video_Commit_Control,
                               MIN(req->wLength, sizeof(USBD_VideoControlTypeDef)));
    }
    else
    {
      (void)USBD_LL_StallEP(pdev, 0x80U);
    }
  }
}

#ifndef USE_USBD_COMPOSITE
/**
  * @brief  USBD_VIDEO_GetFSCfgDesc
  *         return configuration descriptor
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t  *USBD_VIDEO_GetFSCfgDesc(uint16_t *length)
{
  USBD_EpDescTypeDef *pEpDesc = USBD_GetEpDesc(USBD_VIDEO_CfgDesc, VIDEOinEpAdd);
  USBD_VIDEO_VSFrameDescTypeDef *pVSFrameDesc = USBD_VIDEO_GetVSFrameDesc(USBD_VIDEO_CfgDesc);

  if (pEpDesc != NULL)
  {
    pEpDesc->wMaxPacketSize = UVC_ISO_FS_MPS;
  }

  if (pVSFrameDesc != NULL)
  {
    pVSFrameDesc->dwMinBitRate = UVC_MIN_BIT_RATE(UVC_CAM_FPS_FS);
    pVSFrameDesc->dwMaxBitRate = UVC_MAX_BIT_RATE(UVC_CAM_FPS_FS);
    pVSFrameDesc->dwDefaultFrameInterval = UVC_INTERVAL(UVC_CAM_FPS_FS);
    pVSFrameDesc->dwMinFrameInterval = UVC_INTERVAL(UVC_CAM_FPS_FS);
  }

  *length = (uint16_t)(sizeof(USBD_VIDEO_CfgDesc));
  return USBD_VIDEO_CfgDesc;
}

/**
  * @brief  USBD_VIDEO_GetHSCfgDesc
  *         return configuration descriptor
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t  *USBD_VIDEO_GetHSCfgDesc(uint16_t *length)
{
  USBD_EpDescTypeDef *pEpDesc = USBD_GetEpDesc(USBD_VIDEO_CfgDesc, VIDEOinEpAdd);
  USBD_VIDEO_VSFrameDescTypeDef *pVSFrameDesc = USBD_VIDEO_GetVSFrameDesc(USBD_VIDEO_CfgDesc);

  if (pEpDesc != NULL)
  {
    pEpDesc->wMaxPacketSize = UVC_ISO_HS_MPS;
  }

  if (pVSFrameDesc != NULL)
  {
    pVSFrameDesc->dwMinBitRate = UVC_MIN_BIT_RATE(UVC_CAM_FPS_HS);
    pVSFrameDesc->dwMaxBitRate = UVC_MAX_BIT_RATE(UVC_CAM_FPS_HS);
    pVSFrameDesc->dwDefaultFrameInterval = UVC_INTERVAL(UVC_CAM_FPS_HS);
    pVSFrameDesc->dwMinFrameInterval = UVC_INTERVAL(UVC_CAM_FPS_HS);
  }

  *length = (uint16_t)(sizeof(USBD_VIDEO_CfgDesc));
  return USBD_VIDEO_CfgDesc;
}

/**
  * @brief  USBD_VIDEO_GetOtherSpeedCfgDesc
  *         return configuration descriptor
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t  *USBD_VIDEO_GetOtherSpeedCfgDesc(uint16_t *length)
{
  USBD_EpDescTypeDef *pEpDesc = USBD_GetEpDesc(USBD_VIDEO_CfgDesc, VIDEOinEpAdd);
  USBD_VIDEO_VSFrameDescTypeDef *pVSFrameDesc = USBD_VIDEO_GetVSFrameDesc(USBD_VIDEO_CfgDesc);

  if (pEpDesc != NULL)
  {
    pEpDesc->wMaxPacketSize = UVC_ISO_FS_MPS;
  }

  if (pVSFrameDesc != NULL)
  {
    pVSFrameDesc->dwMinBitRate = UVC_MIN_BIT_RATE(UVC_CAM_FPS_FS);
    pVSFrameDesc->dwMaxBitRate = UVC_MAX_BIT_RATE(UVC_CAM_FPS_FS);
    pVSFrameDesc->dwDefaultFrameInterval = UVC_INTERVAL(UVC_CAM_FPS_FS);
    pVSFrameDesc->dwMinFrameInterval = UVC_INTERVAL(UVC_CAM_FPS_FS);
  }

  *length = (uint16_t)(sizeof(USBD_VIDEO_CfgDesc));
  return USBD_VIDEO_CfgDesc;
}

/**
  * @brief  DeviceQualifierDescriptor
  *         return Device Qualifier descriptor
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t  *USBD_VIDEO_GetDeviceQualifierDesc(uint16_t *length)
{
  *length = (uint16_t)(sizeof(USBD_VIDEO_DeviceQualifierDesc));
  return USBD_VIDEO_DeviceQualifierDesc;
}

/**
  * @brief  USBD_VIDEO_GetVSFrameDesc
  *         This function return the Video Endpoint descriptor
  * @param  pdev: device instance
  * @param  pConfDesc:  pointer to Bos descriptor
  * @retval pointer to video endpoint descriptor
  */
static void *USBD_VIDEO_GetVSFrameDesc(uint8_t *pConfDesc)
{
  USBD_DescHeaderTypeDef *pdesc = (USBD_DescHeaderTypeDef *)(void *)pConfDesc;
  USBD_ConfigDescTypeDef *desc = (USBD_ConfigDescTypeDef *)(void *)pConfDesc;
  USBD_VIDEO_VSFrameDescTypeDef *pVSFrameDesc = NULL;
  uint16_t ptr;

  if (desc->wTotalLength > desc->bLength)
  {
    ptr = desc->bLength;

    while (ptr < desc->wTotalLength)
    {
      pdesc = USBD_GetNextDesc((uint8_t *)pdesc, &ptr);

      if (((pdesc->bDescriptorSubType == VS_FRAME_MJPEG) ||
           (pdesc->bDescriptorSubType == VS_FRAME_UNCOMPRESSED)) &&
          (pdesc->bLength == VS_FRAME_DESC_SIZE))
      {
        pVSFrameDesc = (USBD_VIDEO_VSFrameDescTypeDef *)(void *)pdesc;
        break;
      }
    }
  }

  return (void *)pVSFrameDesc;
}
#endif /* USE_USBD_COMPOSITE */

/**
  * @brief  USBD_VIDEO_GetVideoHeaderDesc
  *         This function return the Video Header descriptor
  * @param  pdev: device instance
  * @param  pConfDesc:  pointer to Bos descriptor
  * @retval pointer to the Video Header descriptor
  */
static void *USBD_VIDEO_GetVideoHeaderDesc(uint8_t *pConfDesc)
{
  USBD_ConfigDescTypeDef *desc = (USBD_ConfigDescTypeDef *)(void *)pConfDesc;
  USBD_DescHeaderTypeDef *pdesc = (USBD_DescHeaderTypeDef *)(void *)pConfDesc;
  uint8_t *pVideoDesc = NULL;
  uint16_t ptr;

  if (desc->wTotalLength > desc->bLength)
  {
    ptr = desc->bLength;

    while (ptr < desc->wTotalLength)
    {
      pdesc = USBD_GetNextDesc((uint8_t *)pdesc, &ptr);
      if ((pdesc->bDescriptorType == CS_INTERFACE) &&
          (pdesc->bDescriptorSubType == VC_HEADER))
      {
        pVideoDesc = (uint8_t *)pdesc;
        break;
      }
    }
  }
  return pVideoDesc;
}

/**
  * @brief  USBD_VIDEO_RegisterInterface
  * @param  pdev: instance
  * @param  fops: VIDEO interface callback
  * @retval status
  */
uint8_t USBD_VIDEO_RegisterInterface(USBD_HandleTypeDef   *pdev, USBD_VIDEO_ItfTypeDef *fops)
{
  /* Check if the FOPS pointer is valid */
  if (fops == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  /* Assign the FOPS pointer */
  pdev->pUserData[pdev->classId] = fops;

  /* Exit with no error code */
  return (uint8_t)USBD_OK;
}

/**
  * @}
  */


/**
  * @}
  */


/**
  * @}
  */
